{
  "font": "enFont",
  "fontsize": " ",

  "Who`s": "Who`s",
  "name": "MOHAMED",
  "navbar": {
    "nav": [
      { "name": "Home", "path": "/" },
      { "name": "About", "path": "/about" },
      { "name": "Skills", "path": "/skills" },
      { "name": "Projects", "path": "/projects" },
      { "name": "Education", "path": "/enducation" },
      { "name": "Content", "path": "/contanent" }
    ]
  },

  "Linkedin": "Linkedin",
  "Github": "Github",
  "Whatsapp": "Whatsapp",
  "Facebook": "Facebook",
  "about": "About Me",
  "Introduction": "Introduction",
  "skillsSction": "SKILLS",
  "skillsSubtitle": "WHAT I DO",
  "about_content": [
    "Hello there, I'm so happy you are here! (:",

    "My name is Mohammed Shaaban, I'm 20 and a third-year computer science student based in Menof. I have a strong passion for the technologies related to the Frontend,Backend and UX.",
    " Junior Frontend Developer with 1+ years of experience designing and building responsive web design. Proficient with React and Node Frameworks. Passionate about learning and development with a desire to apply skills on a larger development team. Eager to tackle more complex problems and continue to find ways to maximize user efficiency"
  ],
  "skills": {
    "skill": [
      {
        "id": "html",
        "title": "HTML",
        "icon": "htmlIcon",
        "description": "I have a strong command of HTML for organizing web pages and generating meaningful content that can be accessed by all users."
      },

      {
        "id": "css",
        "title": "CSS",
        "icon": "cssIcon",
        "description": "I possess expertise in utilizing CSS to design web pages and craft visually captivating layouts that enhance the overall user experience."
      },
      {
        "id": "javascript",
        "title": "JavaScript",
        "icon": "jsIcon",
        "description": "I have substantial experience in employing JavaScript to introduce interactivity and functionality into web pages, resulting in dynamic user interfaces."
      },
      {
        "id": "react",
        "title": "React",
        "icon": "reactIcon",
        "description": "I am well-versed in React, proficient in creating reusable components and managing application state using hooks and context."
      },
      {
        "id": "java",
        "title": "Java",
        "icon": "javaIcon",
        "description": "I have extensive utilizing Java for object-oriented programming (OOP)."
      },

      {
        "id": "git",
        "title": "Git",
        "icon": "gitIcon",
        "description": "I am proficient in Git, managing code changes, collaborating with others, and resolving conflicts effectively."
      },
      {
        "id": "github",
        "title": "GitHub",
        "icon": "githubIcon",
        "description": "I am skilled in using GitHub for seamless project collaboration, code sharing, and issue tracking. Through GitHub, I efficiently create and manage repositories and effectively present my work to potential employers."
      },

      {
        "id": "vite",
        "title": "Vite",
        "icon": "viteIcon",
        "description": "I have gained considerable experience working with Vite for approximately six months, leveraging its capabilities to build React websites and seamlessly deploy them on platforms like Netlify."
      },

      {
        "id": "node",
        "title": "Node",
        "icon": "nodeIcon",
        "description": "When it comes to building web applications, I prefer using Node as my runtime environment over Yarn. I have expertise in leveraging Node.js to develop powerful and scalable web applications."
      }
    ]
  }
}
